package com.openknowl.tutorials.subject1;

public class Subject {

    public static void main(String[] args) {
        /*
         * 예제 코드를 기반으로
         * 채팅 프로그램을 만들어보자.
         * 현재 예제코드는 클라이언트에서 서버로 메세지를 한번만 받으면 소켓이 닫혀져,
         * 메세지를 주고받을 수 없는 구조로 작성되어있다.
         *
         * 클라이언트와 서버가 서로 한번씩 메세지를 보내게 되어있으니,
         * 이를 조금만 수정해보면 클라이언트와 서버가 메세지를 주고받을 수 있는.
         * 즉 채팅 프로그램을 완성할 수 있지 않을까 ?
         *
         * 예제 코드를 수정하여 채팅프로그램을 만들어보고,
         * 구현도중 겪었던 문제에 대해 주석을 통해서 아주 장황하게 설명해보자.
         */
    }

}
